driver-tests/smtpbc/SMTPBCTests/SMTPJavaEESEOutbound/src/java/SmtpInboundTest.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/SmtpInboundTest"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/SmtpInboundTest" name="SmtpInboundTest" xmlns:ns="http://j2ee.netbeans.org/xsd/tableSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:file="http://schemas.sun.com/jbi/wsdl-extensions/file/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/SmtpInboundTest">
            <xsd:import namespace="http://j2ee.netbeans.org/xsd/tableSchema" schemaLocation="TEST.xsd"/>
        </xsd:schema>
    </types>
    <message name="SmtpInboundTestOperationRequest">
        <part name="part1" element="ns:TEST"/>
    </message>
    <portType name="SmtpInboundTestPortType">
        <wsdl:operation name="SmtpInboundTestOperation">
            <wsdl:input name="input1" message="tns:SmtpInboundTestOperationRequest"/>
        </wsdl:operation>
    </portType>
    <binding name="SmtpInboundTestBinding" type="tns:SmtpInboundTestPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="SmtpInboundTestOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal"/>
            </wsdl:input>
        </wsdl:operation>
    </binding>
    <service name="SmtpInboundTestService">
        <wsdl:port name="SmtpInboundTestPort" binding="tns:SmtpInboundTestBinding">
            <soap:address location="http://localhost:18181/SmtpInboundTestService/SmtpInboundTestPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="SmtpInboundTestPartner">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="SmtpInboundTestPortTypeRole" portType="tns:SmtpInboundTestPortType"/>
    </plnk:partnerLinkType>
</definitions>
