driver-tests/smtpbc/SMTPBCTests/SMTPJavaEESEOutboundJbi/test/SMTPOutboundTestCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tab="http://j2ee.netbeans.org/xsd/tableSchema">
  <soapenv:Body>
    <tab:TEST>
      <tab:NAME>StudentName</tab:NAME>
      <tab:ID>2</tab:ID>
    </tab:TEST>
  </soapenv:Body>
</soapenv:Envelope>